{
  "blogs": [
    {
      "title": " Ways to get your Dream job in product based companies if you are from tier 3 college.",
      "body": "We will talk about paths Or ways to land your dream job if you are from tier 3 colleges.\nLearn language like C++ or Java and Start to do competitive programming on websites like Hacker Rank, TopCoder, HackerEarth, CodeChef, Leetcode, etc. Then after good practice start to participate in online contests on the above websites.\nGoogle hires top participants of their online contest like Kick Start, code jam, hash code. You can participate in those.\nAfter scoring well you can put your certificate on LinkedIn and if you have very high scores Or batches you can request people who working in good companies to recommend you with your amazing scores.\nMake your LinkedIn profile very nice and wide your network. The network will be more helpful for a career .\nYou should also participate in an online Or offline Hackathon. It will boost your Confidence and network also. There are so many online Hackathon happens.\nMaking projects much as you can and contribute to open source projects. Implement what you learn. Learn from courses, YouTube channels. Put your code on GitHub.\nNext is to do internships. It will give you the experience of work and community and you will gain more knowledge and it will also beneficial for your next job.\nApply in remote internships programs like GSoC and Outreachy etc.\nThese above internships will give you much more experience and also a high stipend 😁.\nGo to meetup.com and join in groups join in meetings and explore your self.\nI write above things which are said by experience people from big companies and people there are so many people on youtube that giving back their knowledge to Community so find them and follow them. Clap 👏 If this article helps you.",
      "author": "Ishita",
      "id": 3
    },
    {
      "title": " Journey to the world of open source ",
      "body": "Today during this journey to the world of open source we will talk about some interesting topics.\nImage for post\n● Why should you contribute to open-Source?\nWho contributes to open source projects gets more knowledge of technology and how it will help to understand the internals of that technology works in real-world software development. You will get recognized by your contributions to projects. Students, employers everyone can showcase their work and skills to the world. It provides value in your resume.you can mention that you have contributed to this project. You gain exposure and make a bond with the community and increase your network.\n● How can I find the right projects to contribute?\nGo to the Explore tab on Github. It will show projects based on your interest or write the name of the topic or technology in the search bar on GitHub and choose any project that you liked. Or go to Google Summer of Code’s website and in the Project tab, you find many interesting and popular projects. You can do the same on Outreachy’s website.\n● My experience In Contributor’s Hack\nContributor’s Hack was my fist open-source program that I participated in. I saw many interesting projects on the website then I selected NeoAlgo To which I was very excited to contribute. The project was about to have in a single place all possible algorithms and data structures in multiple languages. Before working on a project I get more details of projects and I communicate with my project mentor and other fellows. In the period of working on the project, I started to find Good First Issues and issues for beginner, medium, etc as given labels. I found issues that I can solve and I asked the maintainer to assign an issue to me. I solved that issue and did my first Pull Request In contributor’s hack. The maintainer told me to do changes and also helped me when I faced merged conflict. I did changes and finally, my First PR got merged. Maintainers were focusing on clean and accurate code. During the coding period, I learn How to write clean and effective code. I was super happy and that I can’t describe it in words. we communicate on the slack channel, I got to know something new every day. The journey was great and that’s how you can contribute to projects.\n● Best Practice to follow in open source\nLearn git and GitHub first then always read Documentation of projects given in README.md or CONTRIBUTE.md. Fork and clone projects and make different branches for every issue. Don’t work on the issue that is already assigned to someone and ask politely to assign issues. Communicating with others can always help you in open source contributions. Write clean code and give the necessary information in the Pull Request. Don’t give up if your PR does not merge. Never stop at any point, try to improve your code and try again.\n● My First PR Get Merged\nI started open source contribution last year, that was a time before Hacktoberfest. I got to know about Open-Source. first I learn the basics of git and Github then I find good first issues on Github and I ask to assign that issue and I find details of the topic of the issue on the internet and after that start to solve an issue. I did my First PR and that got merged. I was really happy to complete my first step towards open source.\nImage for postImage for post\nConclusion: TO start to contribute to open source you don’t need to learn everything about any technology. You can contribute while learning. just show your skills and work and help others.\nClap 👏 if this Article helps you.",
      "author": "Ishita",
      "id": 4
    }
  ]
}